app/views/top/index.html.erb

SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`product_id` = 40
---
                        <span class="rating-star">
                          <% if product.reviews.present? %>