app/controllers/products_controller.rb

  def index
    # productsテーブルから最新順に作品を２０件取得する
    @products = Product.order('open_date DESC').limit(20)
---
SELECT  `products`.* FROM `products`  ORDER BY open_date DESC LIMIT 20

  def show
    # productsテーブルから該当するidの作品情報を取得し@productの変数へ代入する処理を書いて下さい
    @product = Product.find(params[:id]) # 問題3ではこのコードは消して新しくコードを書いてください
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 13 LIMIT 1

  def search
    # 検索フォームのキーワードをあいまい検索して、productsテーブルから20件の作品情報を取得する
    @products = Product.where('title like(?)',"%#{params[:keyword]}%").limit(20)
---
SELECT  `products`.* FROM `products` WHERE (title like('%keyword%')) LIMIT 20