app/controllers/reviews_controller.rb

INSERT INTO `reviews` (`rate`, `review`, `product_id`, `nickname`, `created_at`, `updated_at`) VALUES (4, 'yoki', 13, 'reader', '2018-09-16 23:40:54', '2018-09-16 23:40:54')
---
  def create
    Review.create(create_params)