app/views/products/show.html.erb

SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`product_id` = 1
---
              </header>
              <% @product.reviews.each do |review| %>